In [ ]:
# 5.2.1 재색인

In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [4]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [5]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [7]:
obj3.reindex(range(6), method='ffill') # ffill 은 누락된 값을 직전의 값으로 채워 넣을 수 있다

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [8]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index = ['a', 'c', 'd'],
                    columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [9]:
frame2 = frame.reindex(['a', 'b', 'c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [13]:
states2 = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [22]:
frame.reindex(['a','b','c','d'], columns=states) # loc은 이제 바로 쓸 수 없음

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [23]:
# 5.2.2 하나의 로우나 컬럼 삭제

In [24]:
obj = pd.Series(np.arange(5.), index = ['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [25]:
new_obj = obj.drop('c') # drop 을 사용해서 index 하나를 날릴 수 있다
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [26]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [27]:
obj # 이래도 데이터는 살아있다

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [28]:
data = pd.DataFrame(np.arange(16.).reshape(4,4),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

           one   two  three  four
Ohio       0.0   1.0    2.0   3.0
Colorado   4.0   5.0    6.0   7.0
Utah       8.0   9.0   10.0  11.0
New York  12.0  13.0   14.0  15.0

In [29]:
data.T

       Ohio  Colorado  Utah  New York
one     0.0       4.0   8.0      12.0
two     1.0       5.0   9.0      13.0
three   2.0       6.0  10.0      14.0
four    3.0       7.0  11.0      15.0

In [30]:
data.drop(['Ohio', 'Utah'])

           one   two  three  four
Colorado   4.0   5.0    6.0   7.0
New York  12.0  13.0   14.0  15.0

In [31]:
data.drop('two', axis=1) # column 의 값을 삭제할 때는 1 이나 'columns' 를 인자로 넘겨주면 없어진다

           one  three  four
Ohio       0.0    2.0   3.0
Colorado   4.0    6.0   7.0
Utah       8.0   10.0  11.0
New York  12.0   14.0  15.0

In [32]:
obj.drop('c', inplace=True) # inplace 를 붙여주면 원본 값을 건드릴 수 있다
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [33]:
# 5.2.3 색인하기, 선택하기, 거르기

In [34]:
obj = pd.Series(np.arange(4.), index = ['a','b','c','d'])

In [35]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [36]:
obj['b'] == obj[1] # 같은거다.

True

In [37]:
obj['b':'c'] # 라벨 이름으로 슬라이싱을 하면 시작점과 끝값을 포함한다.

b    1.0
c    2.0
dtype: float64

In [38]:
data['two']

Ohio         1.0
Colorado     5.0
Utah         9.0
New York    13.0
Name: two, dtype: float64

In [39]:
data[:2]

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  5.0    6.0   7.0

In [40]:
data < 7

            one    two  three   four
Ohio       True   True   True   True
Colorado   True   True   True  False
Utah      False  False  False  False
New York  False  False  False  False

In [41]:
# loc과 iloc으로 선택하기

In [42]:
# loc: 축 이름선택
# iloc: 정수 색인 선택

In [45]:
data

           one   two  three  four
Ohio       0.0   1.0    2.0   3.0
Colorado   4.0   5.0    6.0   7.0
Utah       8.0   9.0   10.0  11.0
New York  12.0  13.0   14.0  15.0

In [43]:
data.iloc[2, [3, 0, 1]]

four    11.0
one      8.0
two      9.0
Name: Utah, dtype: float64

In [44]:
data.iloc[2]

one       8.0
two       9.0
three    10.0
four     11.0
Name: Utah, dtype: float64

In [46]:
data.loc[:'Utah', 'two']

Ohio        1.0
Colorado    5.0
Utah        9.0
Name: two, dtype: float64

In [51]:
data.iloc[:, :3][data.three > 1]  # 기준은 조건을 만족하는 가의 여부로 출력되는 종류를 제한할 수 있다.

           one   two  three
Ohio       0.0   1.0    2.0
Colorado   4.0   5.0    6.0
Utah       8.0   9.0   10.0
New York  12.0  13.0   14.0

In [52]:
# 5.2.4 정수 색인

In [53]:
ser = pd.Series(np.arange(3.))

In [54]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [57]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [58]:
ser[:1]

0    0.0
dtype: float64

In [59]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [60]:
ser.iloc[:1] # 정수 색인

0    0.0
dtype: float64

In [61]:
# 5.2.5 산술 연산과 데이터 정렬

In [62]:
# 색인과 컬럼이 다른 경우에 몇가지 중복만을 가지는 2개의 dataframe을 연산하면 자연스럽게 부족한 부분은 채워진다.
# 둘 중 하나라도 값이 없는 경우는 NaN 값으로 결과가 출력된다

In [63]:
# 산술 연산 메서드에 채워 넣을 값 지정하기

In [64]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                  columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns=list('abcde'))
df2.loc[1, 'b'] = np.nan

In [65]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [66]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [67]:
df1 +df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [68]:
df1.add(df2, fill_value = 0) # fill_value = 0 를 사용하면 둘 중 하나의 값이 있는 걸로 값이 채워진다

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [69]:
df1.rdiv(1) # 나눗셈 메서드

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [71]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [72]:
# DataFrame과 Series의 연산

In [73]:
arr = np.arange(12.).reshape(3,4)
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [74]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [78]:
frame = pd.DataFrame(np.arange(12.).reshape(4,3),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [79]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [80]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [81]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [83]:
series2 = pd.Series(range(3), index=['b','e','f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [84]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [85]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [87]:
frame.sub(series3, axis='index')  # axis 값, 연산을 적용할 축 번호

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [88]:
# 5.2.6 함수 적용과 매핑

In [89]:
frame = pd.DataFrame(np.random.randn(4,3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.960216 -0.747571 -0.089624
Ohio   -0.619624 -0.113758 -0.809679
Texas   0.785953 -1.727953 -0.496952
Oregon -0.406748  0.310334  0.245922

In [90]:
np.abs(frame)  # 음수인 것들을 모두 양수로 변환해줌

               b         d         e
Utah    1.960216  0.747571  0.089624
Ohio    0.619624  0.113758  0.809679
Texas   0.785953  1.727953  0.496952
Oregon  0.406748  0.310334  0.245922

In [91]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.579839
d    2.038288
e    1.055601
dtype: float64

In [92]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.619624 -1.727953 -0.809679
max  1.960216  0.310334  0.245922

In [93]:
format = lambda x: '%.2f' % x # 실수값이 문자열 포맷으로 변경됌
frame.applymap(format)

            b      d      e
Utah     1.96  -0.75  -0.09
Ohio    -0.62  -0.11  -0.81
Texas    0.79  -1.73  -0.50
Oregon  -0.41   0.31   0.25

In [94]:
frame['e'].map(format) # applymap은 dataframe, mapd은 series

Utah      -0.09
Ohio      -0.81
Texas     -0.50
Oregon     0.25
Name: e, dtype: object

In [95]:
# 5.2.7 정렬과 순위

In [96]:
obj = pd.Series(range(4), index=['d', 'a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [97]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=['d','a','c','b'])
frame.sort_index()

       d  a  c  b
one    4  5  6  7
three  0  1  2  3

In [98]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  3  2  0
one    5  7  6  4

In [99]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [100]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [101]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [102]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [103]:
frame.sort_values(by='b') # 컬럼이름을 남기면 기준으로 정렬된다.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [105]:
frame.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [106]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()  # 동점인 항목에 대해서는 평균순위를 매김

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [107]:
obj.rank(method='first') # 데이터 상에 나타나는 순서에 따라 순위를 매길 수 있다

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [108]:
obj.rank(ascending=False, method='max')  # 내림차순 정렬

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [109]:
# 5.2.8 중복 색인

In [110]:
obj = pd.Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [111]:
obj.index.is_unique  # 해당 값이 유일한지에 대한 여부 확인

False

In [112]:
df = pd.DataFrame(np.random.randn(4,3), index=['a', 'a','b','b'])
df

          0         1         2
a -0.553595 -1.950426  0.175691
a  0.023966 -1.156540 -0.228207
b -0.494546  0.549361  0.476329
b -0.382988  1.914453 -0.371870

In [113]:
df.applymap(format)

       0      1      2
a  -0.55  -1.95   0.18
a   0.02  -1.16  -0.23
b  -0.49   0.55   0.48
b  -0.38   1.91  -0.37